# CSS 边框颜色(设置/更改边框颜色)

> 原文:[https://codescracker.com/css/css-border-color.htm](https://codescracker.com/css/css-border-color.htm)

CSS **border-color** 属性在我们需要给一个元素的所有四个边框着色时使用。举 的例子:

HTML with CSS Code

```
<!DOCTYPE html>
<html>
<head>
   <style>
      h2 {border-style: solid; border-color: crimson;}
      p {border-style: solid; border-color: brown;}
   </style>
</head>
<body>

   <h2>The border-color Property</h2>
   <p>This is a para.</p>

</body>
</html>
```

Output

## 边框颜色属性

这是一个段落。

## CSS 边框颜色语法

CSS 中 **border-color** 属性的语法是:

```
border-color: x;
```

**x** 的值应该是下列值之一:

*   [颜色](/css/css-color-names-codes-rgb-hexadecimal.htm) -用于使用颜色的 名、RBG 值、十六进制值或任何你用来识别颜色的方法来定义颜色
*   **透明** -用于定义透明边框
*   **初始** -用于设置默认边框
*   **继承** -用于从其父项继承和设置边框

## CSS 边框-多值颜色

我们还可以为 **border-color** 属性定义多种颜色，为不同的 边定义不同的颜色。

#### 四值边框颜色

*   第一个值指的是上边框
*   第二个值是指右边框
*   第三个值指的是下边框
*   第四个值指的是左边界

#### 有三个值的边框颜色

*   第一个值指的是上边框
*   第二个值指的是右边界和左边界
*   第三个值指的是下边框

#### 有两个值的边框颜色

*   第一个值是指上边框和下边框
*   第二个值指的是右边界和左边界

### 多值边框颜色示例

HTML with CSS Code

```
<!DOCTYPE html>
<html>
<head>
   <style>
      p#one {border-style: solid; border-width: 12px; padding: 12px;
            border-color: darkgoldenrod forestgreen blueviolet fuchsia;}
      p#two {border-style: solid; border-width: 12px; padding: 12px;
            border-color: darkgoldenrod forestgreen blueviolet;}
      p#three {border-style: solid; border-width: 12px; padding: 12px;
            border-color: darkgoldenrod forestgreen;}
      p#four {border-style: solid; border-width: 12px; padding: 12px;
            border-color: darkgoldenrod;}
   </style>
</head>
<body>

   <p id="one">This is a para (4 border color).</p>
   <p id="two">This is another para (3 border color).</p>
   <p id="three">This is the third para (two border color).</p>
   <p id="four">This is para four (one border color).</p>

</body>
</html>
```

Output

这是一款 para (4 边框颜色)。

这是另一个 para (3 边框颜色)。

这是第三个 para(两个边框颜色)。

这是第四段(一种边框颜色)。

[CSS 在线测试](/exam/showtest.php?subid=5)

* * *

* * *